modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_multiplesignatures3.xml

<!--
  Request with body signed by Alice and Bob (X.509)
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-11DA83020116EB58C515227977857521056">MIICgjCCAWqgAwIBAgIJALLt3UmjdE/TMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjMxNjIxWhgPMjExODAzMDIyMzE2MjFaMEIxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIUJPCtG7JthGRmQ8G1iryHRwCaU7aBRNqPl5dakkUsyoZLQ/ZBp7pOor6PnP/8l2FwF39bT8cR2lo2CqQqZ2UE7lCVq0Iz210U8Z1I7BcZw/ucEFhYE3NBsrXmI1eMTe9hwdvqvCmN48SWK1T4LaeYNN+P+QUSnkSEm8MvFQMiPAgMBAAGjDzANMAsGA1UdDwQEAwIEsDANBgkqhkiG9w0BAQUFAAOCAQEAFFJdESl83b5ChMRW6xfJJsfvG+Hdi55Ppgz98gKgoYMewX4dGAbaELLxeGH1iWvtuvUjxW4jEBkoV5iVtKDVwwJElt/mOFTnTguhdd/OJYDnNtVQd+URvk6QnG8tAvoKQxqsp6DSrs81W/pWVXMXe3xektcfq+NlGl1ylbmsj+oFd+XfiZbKKfE9YU4Q9oGs48T70a4uvIRhyaswZlO1vu+QNHHss40mwrhZV9s1QEOV8+l1EiyornIOQLVX/mQoBY+2wh5I5G7IzZp6oWA+L578D5KI84Yh4xXKR5+1r4P1+yCDNxIO6J+Iyizb5cEEcaS25Qw6GMUuVd/KKYqUWw==</wsse:BinarySecurityToken><ds:Signature Id="SIG-11DA83020116EB58C515227977857521059" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-11DA83020116EB58C515227977857441054"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>rhH/e5QwuNqiw6rK1tL3FvNm2XU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>XcKR7RfwPHhKjAX7awpsJ43MgZBOGvMaBlxeuFlzFXb+4HFabSXnbsDb5z2NFyeb7SBV6Fv+UAbH
rgeGJepFsc4qJtr2AJiFGD5J1uQuzti1AQr1+UZkSNxRUPOWQJ+j4MzBl/hC22oUoaHUN741aFEh
Iy8QCw5Rpn5YjOLyiYM=</ds:SignatureValue><ds:KeyInfo Id="KI-11DA83020116EB58C515227977857521057"><wsse:SecurityTokenReference wsu:Id="STR-11DA83020116EB58C515227977857521058"><wsse:Reference URI="#X509-11DA83020116EB58C515227977857521056" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-11DA83020116EB58C515227977857441051">MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAzMDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTEjeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpWEYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+nQkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y90JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm87TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqidNNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3HUFY09XXtTrXgeOyBUpVlmA=</wsse:BinarySecurityToken><ds:Signature Id="SIG-11DA83020116EB58C515227977857451055" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-11DA83020116EB58C515227977857441054"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>rhH/e5QwuNqiw6rK1tL3FvNm2XU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>R4HSHwvdIoyEQILZP5GH62XsC0RC/D1P3q5l0GTwbMzCLh9Z7kunRFPppC9+FrBSMV9EkUpEcMc0
xABYth1HepIkckGrGkehSgklg/zTqdD3pIRdNbW0gYlZNqG6tSACEfh/875TUkx36ekq39Er+8tq
UMMGFznBnBhnUI8SzIM=</ds:SignatureValue><ds:KeyInfo Id="KI-11DA83020116EB58C515227977857441052"><wsse:SecurityTokenReference wsu:Id="STR-11DA83020116EB58C515227977857441053"><wsse:Reference URI="#X509-11DA83020116EB58C515227977857441051" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-11DA83020116EB58C515227977857441054" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>