modules/common/src/test/resources/com/l7tech/common/resources/ecc/ecdsa_sha384_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" actor="secure_span" soapenv:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-2-c55f46ae836e53bd690e4021ec31a516"><wsu:Created>2009-04-03T17:06:31.901546892Z</wsu:Created><wsu:Expires>2009-04-03T17:11:31.901Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="BinarySecurityToken-0-816fd939d2deac6e7c244787491959fa">MIIBHTCB3KADAgECAgkA5JznuZmXgIMwCQYHKoZIzj0EATAbMRkwFwYDVQQDDBB0ZXN0OS5sN3RlY2guY29tMB4XDTA5MDQwMTE5NTcyNFoXDTEwMDQwMTE5NTcyNFowGzEZMBcGA1UEAwwQdGVzdDkubDd0ZWNoLmNvbTBAMBAGByqGSM49AgEGBSuBBAAPAywABADShYzInAETM9tMJRyWYwXCPbV/EQDofcPeXFGxN9TrTtd+DOJEcs9jsqMjMCEwDwYDVR0TAQH/BAUwAwEB/zAOBgNVHQ8BAf8EBAMCAY4wCQYHKoZIzj0EAQMxADAuAhUB8C61OhJM8p6dsol//tf2nPcEiO0CFQOX+eW1OppoAwxwljpbDmPYfE74lg==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#ecdsa-sha384"></ds:SignatureMethod><ds:Reference URI="#Body-1-fc85dfb7921c484a291daf3ef458b8e6"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#sha384"></ds:DigestMethod><ds:DigestValue>0fuwLqbpGdhE46X94cYwaVppzhgT+XZBEh0IYxnEjp5u8MZ1fOydca4hl1Lk4hx+</ds:DigestValue></ds:Reference><ds:Reference URI="#Timestamp-2-c55f46ae836e53bd690e4021ec31a516"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#sha384"></ds:DigestMethod><ds:DigestValue>lC1X+Y2RWFUa5cjrrO0Hh6Y3wWrgShIrVTyV3ZPV6Q0wIXdPv1wD1nXCZezAkB3K</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>MC4CFQMDM1OBNFGmhJqP5nNr/VjsG07JhwIVA3U3HMd+2PuITR479OdOferMUKOf</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#BinarySecurityToken-0-816fd939d2deac6e7c244787491959fa" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body-1-fc85dfb7921c484a291daf3ef458b8e6">
      <ws:listProducts>
         <ws:delay>17</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>